##poemlist = ['日出便見風雲散，光明清淨照世間，一向前途通大道，萬事清吉保平安。',
##'於今此景正當時，看看欲吐百花魁，若能遇得春色到，一洒清吉脫塵埃。',
##'勸君把定心莫虛，天註衣祿自有餘，和合重重常吉慶，時來終遇得明珠。',
##'風恬浪靜可行舟，恰是中秋月一輪，凡事不須多憂慮，福祿自有慶家門。',
##'長江風浪漸漸靜，于今得進可安寧，必有貴人相扶助，凶事脫出見太平。']
##num = int(input('輸入籤詩號碼:'))
##print('籤詩為:', poemlist[num-1])

poemdict = {1:'日出便見風雲散，光明清淨照世間，一向前途通大道，萬事清吉保平安。',
2:'於今此景正當時，看看欲吐百花魁，若能遇得春色到，一洒清吉脫塵埃。',
3:'勸君把定心莫虛，天註衣祿自有餘，和合重重常吉慶，時來終遇得明珠。',
4:'風恬浪靜可行舟，恰是中秋月一輪，凡事不須多憂慮，福祿自有慶家門。',
5:'長江風浪漸漸靜，于今得進可安寧，必有貴人相扶助，凶事脫出見太平。'}
key = int(input('輸入籤詩號碼:'))
print('籤詩為:', poemdict[key])
